In [24]:
#1.   Python program to display the sum of n numbers using the list
n = int(input("Enter the number of elements you want to add: "))

# initialize an empty list
numbers = []

# loop through n times and add the numbers to the list
for i in range(n):
    num = int(input("Enter number: "))
    numbers.append(num)

# calculate the sum using the built-in sum() function
total = sum(numbers)

# display the sum
print("The sum of the numbers is:", total)

Enter the number of elements you want to add: 3
Enter number: 1
Enter number: 2
Enter number: 3
The sum of the numbers is: 6

In [5]:
#2. Python function which counts vowels and consonant in a word
def count_vowels_consonants(word):
    vowels = 0
    consonants = 0
    
    # Convert the word to lowercase to make it case-insensitive
    word = word.lower()
    
    # Loop through each character in the word
    for char in word:
        if char in "aeiou":
            vowels += 1
        elif char.isalpha():
            consonants += 1
    
    return vowels, consonants

In [6]:

word = "hello"
vowels, consonants = count_vowels_consonants(word)
print("The word", word, "has", vowels, "vowels and", consonants, "consonants.")

The word hello has 2 vowels and 3 consonants.

In [10]:
#5.Python Program to Make a Simple Calculator
first = input("enter first number:")
second = input("enter second number:")
operator = input("enter operator (+,-,*,/,%): ")

first = int(first)
second = int(second)

if operator == "+":
    print(first + second)
elif operator == "-":
    print(first - second)
elif operator == "*":
    print(first * second)
elif operator == "/":
    print(first / second)
elif operator == "%":
    print(first % second)
else:
    print("Invalid Operation")

enter first number:6
enter second number:9
enter operator (+,-,*,/,%): *
54

In [23]:
#3.Create an application using python which can perform the operations mentioned in the below image             
print('*Welcome to State bank of India:*\n')

Balance = 25000

name = int(input("Enter your 4 digit pin Number:"))

choice = int(input("Please choose transaction: \n1-Withdrow \n2-Balance Enquiry \n3-Fast-Cash \nPlease choose transaction:"))

if choice==1:
    a = int(input("Enter withdrowl amount:"))
    Balance = Balance-a
    print("Please take youe amount:", a, "\nBalance:",Balance)
elif choice==2:
    print("Your Balance is:", Balance)
elif choice==3:
    pass
else:
    print("Wrong choice")

*Welcome to State bank of India:*

Enter your 4 digit pin Number:1234
Please choose transaction:
1-Withdrow
2-Balance Enquiry
3-Fast-Cash
Please choose transaction:1
Enter withdrowl amount:25000
Please take youe amount: 25000
Balance: 0

In [133]:
#4. Tests whether a data sample has a Gaussian distribution.
#a)	Generate the data, form H0 and H1 and write python code to test the Normality        
from scipy.stats import shapiro

# generate some data
data = [0.34, 0.28, 0.9, 0.43, 0.53]

# we are doing here the hypothese and null hypothesis
# H0: the data is normally distributed
# H1: the data is not normally distributed
alpha = 0.05

# perform the Shapiro-Wilk test
stat, p = shapiro(data)

# print the results
print('Statistics=%.3f, p=%.3f' % (stat, p))
if p > alpha:
    print('Sample looks Gaussian (fail to reject H0)')
else:
    print('Sample does not look Gaussian (reject H0)')

Statistics=0.875, p=0.286
Sample looks Gaussian (fail to reject H0)

In [25]:
# 5.The objective of this project is to explore a dataset containing customer information for treadmill 
# products for a retail store called Cardio Good Fitness.
#import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
import warnings
warnings.filterwarnings('ignore') # To supress warnings
sns.set(style="whitegrid") # set the background for the graphs

In [84]:
#Reading the csv file cardiogoodfitness.csv in variable 
data=pd.read_csv(r"C:\Users\DELL\Desktop\py exam\CardioGoodFitness.csv")
dffitness=data.copy()

In [85]:
dffitness.head()

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47

In [86]:
dffitness.tail()

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
175,TM798,40,Male,21,Single,6,5,83416,200
176,TM798,42,Male,18,Single,5,4,89641,200
177,TM798,45,Male,16,Single,5,5,90886,160
178,TM798,47,Male,18,Partnered,4,5,104581,120
179,TM798,48,Male,18,Partnered,4,5,95508,180

In [87]:
dffitness.shape

(180, 9)

In [88]:
dffitness.dtypes

Product          object
Age               int64
Gender           object
Education         int64
MaritalStatus    object
Usage             int64
Fitness           int64
Income            int64
Miles             int64
dtype: object

In [89]:
dffitness.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    object
 1   Age            180 non-null    int64
 2   Gender         180 non-null    object
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    object
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: int64(6), object(3)
memory usage: 12.8+ KB

Data Preprocessing

In [90]:
#changing it to  object dtype to category  to save memory
dffitness.Product=dffitness["Product"].astype("category")
dffitness.Gender=dffitness["Gender"].astype("category")
dffitness.MaritalStatus=dffitness["MaritalStatus"].astype("category")

In [91]:
dffitness.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    category
 1   Age            180 non-null    int64
 2   Gender         180 non-null    category
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    category
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: category(3), int64(6)
memory usage: 9.5 KB

In [92]:
dffitness.columns

Index(['Product', 'Age', 'Gender', 'Education', 'MaritalStatus', 'Usage',
       'Fitness', 'Income', 'Miles'],
      dtype='object')

In [93]:
dffitness.isnull().sum()

Product          0
Age              0
Gender           0
Education        0
MaritalStatus    0
Usage            0
Fitness          0
Income           0
Miles            0
dtype: int64

In [94]:
dffitness.duplicated().sum()

0

Examine Data

In [95]:
#This is to look at what all unique values have . Just trying to use python
list_col=['Product','MaritalStatus','Usage','Fitness','Education','Age']

for col in list_col: 
    print('{} :{} ' . format(col.upper(),dffitness[col].unique()))

PRODUCT :['TM195', 'TM498', 'TM798']
Categories (3, object): ['TM195', 'TM498', 'TM798']
MARITALSTATUS :['Single', 'Partnered']
Categories (2, object): ['Partnered', 'Single']
USAGE :[3 2 4 5 6 7]
FITNESS :[4 3 2 1 5]
EDUCATION :[14 15 12 13 16 18 20 21]
AGE :[18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41
 43 44 46 47 50 45 48 42]

In [96]:
dffitness.describe()

,Age,Education,Usage,Fitness,Income,Miles
count,180.000000,180.000000,180.000000,180.000000,180.000000,180.000000
mean,28.788889,15.572222,3.455556,3.311111,53719.577778,103.194444
std,6.943498,1.617055,1.084797,0.958869,16506.684226,51.863605
min,18.000000,12.000000,2.000000,1.000000,29562.000000,21.000000
25%,24.000000,14.000000,3.000000,3.000000,44058.750000,66.000000
50%,26.000000,16.000000,3.000000,3.000000,50596.500000,94.000000
75%,33.000000,16.000000,4.000000,4.000000,58668.000000,114.750000
max,50.000000,21.000000,7.000000,5.000000,104581.000000,360.000000

In [97]:
dffitness.Product.value_counts()

TM195    80
TM498    60
TM798    40
Name: Product, dtype: int64

In [98]:
dffitness.Gender.value_counts()

Male      104
Female     76
Name: Gender, dtype: int64

In [99]:
dffitness.MaritalStatus.value_counts()

Partnered    107
Single        73
Name: MaritalStatus, dtype: int64

In [100]:
dffitness[dffitness['Product'] == 'TM195'].describe().T

,count,mean,std,min,25%,50%,75%,max
Age,80.0,28.5500,7.221452,18.0,23.0,26.0,33.0,50.0
Education,80.0,15.0375,1.216383,12.0,14.0,16.0,16.0,18.0
Usage,80.0,3.0875,0.782624,2.0,3.0,3.0,4.0,5.0
Fitness,80.0,2.9625,0.664540,1.0,3.0,3.0,3.0,5.0
Income,80.0,46418.0250,9075.783190,29562.0,38658.0,46617.0,53439.0,68220.0
Miles,80.0,82.7875,28.874102,38.0,66.0,85.0,94.0,188.0

In [101]:
dffitness[dffitness['Product'] == 'TM498'].describe().T

,count,mean,std,min,25%,50%,75%,max
Age,60.0,28.900000,6.645248,19.0,24.0,26.0,33.25,48.0
Education,60.0,15.116667,1.222552,12.0,14.0,16.0,16.00,18.0
Usage,60.0,3.066667,0.799717,2.0,3.0,3.0,3.25,5.0
Fitness,60.0,2.900000,0.629770,1.0,3.0,3.0,3.00,4.0
Income,60.0,48973.650000,8653.989388,31836.0,44911.5,49459.5,53439.00,67083.0
Miles,60.0,87.933333,33.263135,21.0,64.0,85.0,106.00,212.0

In [102]:
dffitness[dffitness['Product'] == 'TM798'].describe().T

,count,mean,std,min,25%,50%,75%,max
Age,40.0,29.100,6.971738,22.0,24.75,27.0,30.25,48.0
Education,40.0,17.325,1.639066,14.0,16.00,18.0,18.00,21.0
Usage,40.0,4.775,0.946993,3.0,4.00,5.0,5.00,7.0
Fitness,40.0,4.625,0.667467,3.0,4.00,5.0,5.00,5.0
Income,40.0,75441.575,18505.836720,48556.0,58204.75,76568.5,90886.00,104581.0
Miles,40.0,166.900,60.066544,80.0,120.00,160.0,200.00,360.0

Let Visualize the Data and get more insights

Bi variate Analysis

In [113]:
#Average age of customer buying each model
dffitness.groupby('Product')['Age'].mean()

Product
TM195    28.55
TM498    28.90
TM798    29.10
Name: Age, dtype: float64

In [114]:
#Average Income of customer buying each model
dffitness.groupby('Product')['Income'].mean()

Product
TM195    46418.025
TM498    48973.650
TM798    75441.575
Name: Income, dtype: float64

In [115]:
#Average Income of customer buying each model
dffitness.groupby('Product')['Miles'].mean()

Product
TM195     82.787500
TM498     87.933333
TM798    166.900000
Name: Miles, dtype: float64

In [119]:
corr_pairs = dffitness.corr().unstack() # give pairs of correlation
print( corr_pairs[abs(corr_pairs)>0.5]) # Gives us correlated data

Age        Age          1.000000
           Income       0.513414
Education  Education    1.000000
           Income       0.625827
Usage      Usage        1.000000
           Fitness      0.668606
           Income       0.519537
           Miles        0.759130
Fitness    Usage        0.668606
           Fitness      1.000000
           Income       0.535005
           Miles        0.785702
Income     Age          0.513414
           Education    0.625827
           Usage        0.519537
           Fitness      0.535005
           Income       1.000000
           Miles        0.543473
Miles      Usage        0.759130
           Fitness      0.785702
           Income       0.543473
           Miles        1.000000
dtype: float64

In [128]:
prd_mar_gen= pd.crosstab(index=dffitness["Product"], 
                             columns=[dffitness["MaritalStatus"],
                                      dffitness["Gender"]] ,
                             )  
prd_mar_gen

MaritalStatus Partnered      Single
Gender           Female Male Female Male
Product
TM195                27   21     13   19
TM498                15   21     14   10
TM798                 4   19      3   14

In [131]:
prod_gen_fit=pd.crosstab(index=dffitness['Product'],columns=[dffitness['Gender'],dffitness['Fitness']])
prod_gen_fit

Gender  Female               Male
Fitness      1   2   3  4  5    1  2   3  4   5
Product
TM195        0  10  26  3  1    1  4  28  6   1
TM498        1   6  18  4  0    0  6  21  4   0
TM798        0   0   1  1  5    0  0   3  6  24